<?php

	$config["Dir"] = "/enjin/app/Config/";
	 
	//ステータス
	$config["status"] = array( 0 => "有効", 1 => "無効" );

	//イベント開催日程
	$config["ev_status"] = array( 0 => "開催予定", 1 => "開催決定", 2 => "ペンディング", 9 => "キャンセル" );

	//イベント種別
	$config["type"] = array( 0 => "説明会", 1 => "インターン", 2 => "内定者向け", 9 => "その他" );

	//ターゲット選考段階比較タイプ・求人選考段階数目標
	$config["screening_stage_type"] = array( 0 => "以前", 1 => "以降", 2 => "限定" );

	//イベント参加履歴（参加後評価スコア）
	$config["after_score"] = array( 0 => "何としてでも採用したい", 1 => "志願してくれれば採用してもいい", 2 => "将来に期待", 9 => "採用したくない" );

	//イベント参加履歴（ステータス）
	$config["ev_history_status"] = array( 0 => "予約中", 1 => "申込済", 2 => "候補者キャンセル連絡有", 3 => "主催者キャンセル", 4 => "参加済", 5 => "無断欠席", 9 => "削除" );

	//提出書類（ステータス）
	$config["doc_status"] = array( 0 => "有効", 1 => "削除" );

	//採用担当者タイプ
	$config["focal_point_type"] = array( 0 => "人事", 1 => "面接官" );

	//求人票ステータス
	$config["job_status"] = array( 1 => "ペンディング", 0 => "確定", 9 => "キャンセル" );

	//選考履歴／イベント／求人選考段階数目標（選考ステータス・ターゲット選考ステータス）
	$config["select_judgment_type"] = array( 0 => "受付済／スケジュール調整中", 1 => "候補者スケジュール確認済", 2 => "採用担当者スケジュール確認済",
								 3 => "スケジュールFix", 4 => "面接済/評価待ち" , 5 => "合格", 6 => "不合格", 7 => "内定辞退", 8 => "求人都合キャンセル", 9 => "候補者都合キャンセル", 10 => "ペンディング");


	//選考履歴／イベント／求人選考段階数目標（選考ステータス・ターゲット選考ステータス）選考ステータス変更対応
	$config["select_judgment_type_history"] = array( 0 => "受付済／スケジュール調整中", 1 => "候補者スケジュール確認済", 2 => "採用担当者スケジュール確認済",
								 3 => "スケジュールFix", 4 => "面接済/評価待ち" , 7 => "内定辞退", 8 => "求人都合キャンセル", 9 => "候補者都合キャンセル", 10 => "ペンディング");


	//選考履歴（選考ステータスオプション）
	$config["select_option"] = array( "" =>"", 1 => "他社のほうが優先順位が高いため", 2 => "会社や求人に興味が失せたため", 3 => "業種に興味が失せた為", 9 => "その他" );

	//ステータス（選考履歴・候補者・採用担当者選考履歴・語学・特記事項・候補者カスタム属性
	$config["sel_status"] = array( 0 => "有効", 1 => "削除" );

	//最終更新者タイプ（選考履歴・候補者）
	$config["last_modified_type"] = array( 0 => "流入元", 1 => "候補者", 2 => "採用担当者" );

	//候補者（性別）
	$config["sex"] = array( 0 => "男", 1 => "女", 2 => "不明" );

	//求人票公開先流入元企業
	$config["job_vote_status"] = array( 0 => "割当", 1 => "非公開" );

	//採用担当者選考履歴（アサイン状況）
	$config["assign_situation"] = array( 0 => "調整中", 1 => "スケジュール確定選考待ち", 9 => "キャンセル", 2 => "評価済" );

	//採用担当者選考履歴（評価ランク）
	$config["evaluation_rank"] = array( 0 => "保留", 1 => "合格", 9 => "不合格" );

	//語学（外国語）
	$config["add_foreign_language"] = array( 0 => "英語", 1 => "中国語", 2 => "韓国語",  3 => "フランス語", 4 => "ドイツ語", 99 => "それ以外" );

	//語学（レベル）
	$config["add_level"] = array( 0 => "日常会話", 1 => "ビジネスレベル", 2 => "ネイティブ" );

	//特記事項（登録者タイプ）
	$config["register_type"] = array( 0 => "採用担当者", 1 => "流入元" );

	//カスタム項目（タイプ）
	$config["custom_type"] = array( 0 => "文字", 1 => "数値" );

	//流入元タイプ
	$config["influx_original_type"] = array( 0 => "ナビ会社", 1 => "人材紹介会社", 2 => "就職イベント会社",
	                                         3 => "自社", 4 => "学生団体", 5 =>"大学",  6 => "その他", 7 => "リクナビ", 8 => "マイナビ" );

	//流入元企業マスタ(ステータス)
	$config["referer_status"] = array( 0 => "有効", 1 => "契約終了", 9 => "無効" );

	//流入元契約（契約タイプ）
	$config["contract_type"] = array( ''=>"", 1 => "固定", 2 => "無制限（年間固定）", 3 => "年収割合" );

	//流入元契約（契約ステータス）
	$config["inf_status"] = array( 0 => "有効", 1 => "期限切れ", 2 => "自動更新", 9 => "無効" );

	//学歴（文理区分）
	$config["bunri_class"] = array( 0 => "文系", 1 => "理系", 2 => "芸術系", 9 => "その他" );

	//国公私立区分（学校区分）
	$config["school_class"] = array( 0 => "大学院", 1 => "大学", 2 => '高専', 3 => "短期大学", 4 => "専門大学", 5 => "高校", 9 => "その他" );

	//国公私立区分（国公私立区分）
	$config["public_private_class"] = array( 0 => "国立", 1 => "公立", 2 => "私立", 9 => "その他" );

	//国公私立区分（学校ランク）
	$config["school_rank"] = array( 0 => "A", 1 => "B", 2 => "C", 3 => "D", 4 => "E", 9 => "指定無" );

	//ユーザー企業（市場）
	$config["market"] = array( 1 => "東証一部", 2 => "東証二部", 3 => "マザーズ", 4 => "JASDAQ", 5 => "名証一部", 6 => "名証二部",
								7 => "セントレックス", 8 => "札幌市場", 9 => "アンビシャス", 10 => "福岡市場", 11 => "Q-Board", 99 => "その他" );

	//ユーザー企業（業種）
	$config["business"] = array( 1 => "水産・農林業", 2 => "鉱業", 3 => "建設業", 4 => "製造業", 5 => "電気・ガス業", 6 => "指定運輸・情報通信業", 
								7 => "商業", 8 => "金融・保険業", 9 => "不動産業", 10 => "サービス業" );

	//求人票（職種タイプ）
	$config["job_type"] = array( 1 => "事務・管理系", 2 => "企画系", 3 => "営業系", 4 => "技術・研究系", 5 => "販売・サービス系", 6 => "専門系",
									 7 => "医療・福祉系", 8 => "金融系", 9 => "クリエイティブ系", 10 => "IT系", 99 => "その他" );

	//メールテンプレート置換単語
	$config["replace_word"] = array( 
							0  =>'#候補者名#',
							1  =>'#大学名#',
							2  =>'#企業情報#',
							3  =>'#企業名#',
							4  =>'#親部署名#',
							5  =>'#部署名#',
							6  =>'#送信者情報#',
							7  =>'#送信者名#',
							8  =>'#送信者電話番号#',
							9  =>'#送信者メールアドレス#',
							10 =>'#求人担当者情報#',
							11 =>'#求人担当者名#',
							12 =>'#求人担当者メールアドレス#',
							13 =>'#求人担当者電話番号#',
							14 =>'#選考段階#',
							15 =>'#イベント情報#',
							16 =>'#イベント名#',
							17 =>'#イベント開催日時#',
							18 =>'#イベント終了日時#',
							19 =>'#イベント開催場所#',
							20 =>'#求人票名#',
							21 =>'#流入元担当者名#',
							22 =>'#流入元企業名#',
	);

	//CSVインポートエージェントタイプ
	$config["navigater_type"] = array( 1 => "リクナビ", 2 => "マイナビ" );
    
    
    //採用担当者決済者フラグ
    $config["approval_flag"] = array( 0 => "", 1 => "決裁者" );

    //ロック者判定フフラグ
    $config["lock_role_flag"] = array( 0 => "", 1 => "採用担当者" , 2 => "流入元担当者" , 3 => "候補者" );

    //CSVカラム番号判定設定値（マイナビ用）
    $config['mynavi_replace_candidate'] = array(
								1 => 'last_name',
								2 => 'first_name',
								3 => 'last_name_kana',
								4 => 'first_name_kana',
								5 => 'mail_address',
								6 => 'cell_mail',
								14 => 'membership',
								20 => 'country_id',
								21 => 'post_code',
								27 => 'tel',
								28 => 'extension_number',
								29 => 'cell_number',
								30 => 'home_country_id',
								31 => 'home_post_code',
								37 => 'home_tel',
								44 => 'bar_code_id',

	);
    // CSV項目数変化対応用（マイナビ用）
    $config['mynavi_csv_index'] = array(
								0 => "学生管理ID",
								1 => "姓",
								2 => "名",
								3 => "カナ姓",
								4 => "カナ名",
								5 => "e-mail",
								6 => "携帯メール",
								7 => "性別",
								11 => "学校名",
								12 => "学部名",
								13 => "学科名",
								14 => "学校グループ",
								15 => "学生申請文理区分",
								16 => "管理用文理区分",
								17 => "ゼミ",
								18 => "専攻テーマ",
								19 => "サークル",
								20 => "現住所国番号",
								21 => "現住所郵便番号",
								22 => "現住所都道府県",
								23 => "現住所市区郡町村",
								24 => "現住所町名",
								25 => "現住所丁目・番地・号",
								26 => "現住所アパート・マンション名",
								27 => "現住所電話番号",
								28 => "現住所内線番号",
								29 => "携帯番号",
								30 => "休暇中国番号",
								31 => "休暇中郵便番号",
								32 => "休暇中都道府県",
								33 => "休暇中市区郡町村",
								34 => "休暇中町名",
								35 => "休暇中丁目・番地・号",
								36 => "休暇中アパート・マンション名",
								37 => "休暇中電話番号",
								41 => "初回エントリー日",
								43 => "学生基本情報更新日",
								44 => "バーコードID",
								51 => "キャンセルフラグ",
	);

    //CSVカラム番号判定設定値（リクナビ用）
	$config['rikunavi_replace_candidate'] = array(
								1  => 'last_name',
								2  => 'first_name',
								3  => 'last_name_kana',
								4  => 'first_name_kana',
								5  => 'last_name_en',
								6  => 'first_name_en',
								7  => 'bar_code_id',
								8  => 'membership',
								9  => 'mail_address',
								10 => 'cell_mail',
								12 => 'birthday',
								13 => 'post_code',
								18 => 'country_id',
								19 => 'tel',
								20 => 'extension_number',
								21 => 'direct_extension',
								22 => 'cell_number',
								23 => 'home_post_code',
								28 => 'home_country_id',
								29 => 'home_tel',
	);
    // CSV項目数変化対応用（リクナビ用）
    $config['rikunavi_csv_index'] = array(
					0 => "個人ID",
					1 => "氏名（姓）",
					2 => "氏名（名）",
					3 => "フリガナ（姓）",
					4 => "フリガナ（名）",
					5 => "アルファベット氏名（姓）",
					6 => "アルファベット氏名（名）",
					7 => "バーコード",
					8 => "所属グループ",
					9 => "e-mail（PC）",
					10 => "e-mail（携帯・スマートフォン）",
					11 => "性別",
					12 => "生年月日",
					13 => "郵便番号",
					14 => "都道府県",
					15 => "住所",
					16 => "番地",
					17 => "建物",
					18 => "国番号",
					19 => "TEL",
					20 => "内線番号",
					21 => "直通呼出内線区分",
					22 => "携帯電話・PHS",
					23 => "連絡先郵便番号",
					24 => "連絡先都道府県",
					25 => "連絡先住所",
					26 => "連絡先番地",
					27 => "連絡先建物",
					28 => "連絡先国番号",
					29 => "連絡先TEL",
					30 => "入学年月",
					31 => "卒業予定年月",
					36 => "学校名",
					37 => "学部名",
					38 => "学科名",
					40 => "学生申請文理区分",
					41 => "管理用文理区分",
					42 => "所属ゼミ・研究室",
					43 => "専攻テーマ・研究テーマ（題名）",
					44 => "専攻テーマ・研究テーマ（概要）",
					46 => "専攻分野",
					47 => "所属クラブ・サークル",
					68 => "予約状態",
	);

    //選考ステータス公開可否
    $config['open_propriety'] = array(0=>'公開する', 1=>'公開しない');
    $config['open_propriety_search'] = array(""=>"", 0=>'公開する', 1=>'公開しない');

    //用途
    $config["purpose"] = array(0 => 'イベント時候補者向け',1 => '求人公開時候補者向け',2 => '選考時候補者向け',3 => '求人公開時エージェント向け',4 => '選考時エージェント向け');
    
    //資格
    $config["qualifications"] = array(0 => 'TOEIC' , 1 => 'TOEFL' , 2 => '英検' , 3 => 'ITパスポート' , 4 => '基本情報技術者' ,
                                      5 => '応用情報技術者（旧：ソフトウェア開発技術者）' ,  6 => '情報セキュリティスペシャリスト' , 7 => 'ITサービスマネージャ' ,
                                      8 => 'ネットワークスペシャリスト' , 9 => 'データベーススペシャリスト',10 => 'エンベデッドシステムスペシャリスト' , 11 => 'システム監査技術者' ,
                                      12 => 'プロジェクトマネージャ ' , 13 => 'システムアーキテクト' , 14 => 'ITストラテジスト' ,15 => '日商簿記' , 16 => '公認会計士' ,
                                      17 => '税理士' , 18 => '行政書士' , 19 => '中小企業診断士',20 => 'ファイナンシャルプランナー' , 21 => '電気主任技術者' ,
                                      22 => '宅地建物取引主任者' , 23 => '建築士（2級）' , 24 => '旅行業務取扱管理者' ,25 => '介護職員初任者研修（旧：ホームヘルパー2級）' ,
                                      26 => '社会福祉士（予定含む）' , 27 => '介護福祉士（予定含む）' , 28 => '作業療法士（予定含む）' , 29 => '理学療法士（予定含む）',
                                      30 => '薬剤師国家資格（予定含む）' , 31 => '保育士（予定含む）' , 32 => '栄養士（予定含む）' , 33 => '教員免許取得（予定含む）' ,
                                      34 => '普通自動車運転免許', 99=>'その他');

    //選考履歴画面の変更
    $config['change_status_history'] = array( 1=>'流入元への公開を行う',2=>'流入元への公開を行わない',3=>'候補者への公開を行う',4=>'候補者への公開を行わない');

    //選考履歴のメール送信先設定
    $config['check_select'] = array( 1=>'チェックした人',2=>'リスト全員' );
    
    //メール送信テンプレートの用途
    $config['ml_tmplate_use'] = array( 1=>'イベント名', 2=>'求人票名', 3=>'選考段階', 4=>'流入元企業名' );
    
    //メール送信結果
   $config['send_result'] = array( 0=>'成功', 1=>'失敗' );
   
	//送信先
   $config['send_to'] = array( 1=>'流入元担当者', 2=>'候補者', 3=>'採用担当者' );

	//曜日
   $config['weekday'] = array('日','月','火','水','木','金','土',);
    
    
    //流入元企業一覧（契約有無）
    $config['inf_contracts_status'] = array(""=>"", 1=>"有",2 =>"無" );

